# 1. Написать свой генератор последовательностей, свой тернарный оператор
x = 25

res = [x**2 if x <= 15 else x-3]
print(res)


